# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..Dispose Method
MacroModule Class See Also
---
Releases all resources used by the MacroModule
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace